[
	{
		"title":   "DSC-V1 First Attempt",
		"date":    "2024-05-16",
		"camera":  "Sony Cyber-shot DSC-V1",
		"caption": "After rediscovering my Olympus D-510, I quickly realized how nice pocket-sized cameras really are. Because it's in my pocket at all times, I can just quickly whip it out to take photos of anything cool I happen to see when I'm out without having to lug around a chonky camera and bag everywhere. The one big downside of the Olympus though is the complete lack of manual controls - you can adjust ISO and zoom and that's about it - so I did some research on other early 2000s compact cameras that <i>do</i> have manual controls and ultimately decided on the Sony Cyber-shot DSC-V1, a fancy lil pocket cam from 2003 with a whole 5 megapixels! For my first attempt with it, I decided to step outside of my architectural comfort zone and take a walk at a local metro park instead, so please enjoy my highly cliche sunset shots:",
		"photos":  3
	},
	{
		"title":   "Downtown Akron",
		"date":    "2024-05-13",
		"camera":  "Sony Mavica FD200",
		"caption": "Just taking another walk through downtown Akron with my solidified interest in abstract-ish architecture photography. I hadn't really used my Mavica FD200 for any artistic photography yet, so I figured now is as good a time as ever to see how it performs, and I think it did great! The FD200 is a joy to use - its big, bright LCD makes composing photos much easier than on most other contemporary cameras, plus it just radiates a sort of chill, friendly vibe, y'know? Like other Sony cameras, it does seem to over-sharpen darker photos a bit, but I think that can be adjusted in the menu. I'll have to check next time I use it.",
		"photos":  8
	},
	{
		"title":   "Cuyahoga Falls",
		"date":    "2024-05-02",
		"camera":  "Olympus D-510",
		"caption": "Some more quick shots around the Cuyahoga Falls area with my ol' reliable Olympus. I'm still totally in love with the quality and style of the photos it produces - cool, a little undersaturated, tastefully grainy, but still sharp with great shadow detail.",
		"photos":  4
	},
	{
		"title":   "Downtown Akron",
		"date":    "2024-04-30",
		"camera":  "Olympus D-510",
		"caption": "I just recently found my first ever camera while going through some stuff at my parents' house - an Olympus D-510! It's a cute little 2MP point-and-shoot camera from 2001. No manual controls or anything unfortunately, but it's still quite fun to use even today. I totally forgot what its image quality was like, and I've started to develop an interest in architecture photography lately, so I took it with me on a walk around downtown Akron to get some photos of the cool architecture here. I was NOT expecting the photos to turn out like this at all - they almost look, dare I say it, <i>film-like</i>. The deep shadow detail, cooler tones, gently desaturated colors, and subtle grain-like noise all combine to create a beautiful and unique image quality that I haven't really seen from any other digital camera. I'll definitely be adding this camera back into my regular rotation after all these years.",
		"photos":  9
	},
	{
		"title":   "Huntsville Space and Rocket Center",
		"date":    "2024-04-22",
		"camera":  "Sony Alpha a6000",
		"caption": "I recently had to take a trip to Huntsville, AL for work, so I figured that I might as well bring a camera along and get some photography in while I had some free time. A coworker recommended that I check out the US Space and Rocket Center while I was down there, so I stopped in and got some cool shots of the Saturn V rocket and some assorted parts of the Skylab space station. It's a pretty interesting museum all around, although I probably didn't pick the best time to go as a lot of it was under construction unfortunately.",
		"photos":  8
	},
	{
		"title":   "QuickTake First Attempt",
		"date":    "2024-04-17",
		"camera":  "Apple QuickTake 100",
		"caption": "I was just at <a href='https://vcfed.org/events/vintage-computer-festival-east/'>VCF East</a>, a totally rad vintage computer convention that happened this past weekend, and while I was there, I picked up a camera that I've been interested in for quite a while now - the Apple QuickTake 100. Being the first ever mass-market color digital camera, I was intrigued with what the experiece of using it was like and what kind of photos it produced, so I took it with me to downtown Cuyahoga Falls to photograph some of the cool buildings and stuff around there. These photos were taken around sunset right after it rained, and the QuickTake <i>really</i> picked up on the pink tones in the sky, giving all the photos a wonderful, dream-like pink cast. I also absolutely love the weird colorful debayering artifacts present around high-contrast edges. What a funky lil guy! I'll definitely be playing around with it more in the future.",
		"photos":  7
	},
	{
		"title":   "Solar Eclipse 2024",
		"date":    "2024-04-08",
		"camera":  "Sony Mavica FD91",
		"caption": "I conveniently live right in the path of totality for the 2024 North American solar eclipse, so I grabbed my Sony Mavica FD91 and a 16-stop ND filter and met up with some friends to photograph this once-in-a-lifetime experience. The Mav actually managed to capture those red solar protrusions around the Sun during totality! Experiencing totality really was wild - if you ever have the chance to travel for a solar eclipse, I completely recommend it. It's the coolest thing you'll ever see in your life - it felt like existing in a completely different reality for a few minutes.",
		"photos":  2,
		"extrafiles": ["fd91-eclipse.gif"]
	},
	{
		"title":   "Cherry Blossoms in Downtown Akron",
		"date":    "2024-04-06",
		"camera":  "Sony Alpha a6000",
		"caption": "I've been wanting a cute cherry blossom wallpaper for my new pink iPhone 15, but I haven't been able to find any online that I really liked. Luckily for me though, one of the parks in downtown Akron has a few cherry blossom trees planted that were blooming around this time, so a friend and I headed there with my Alpha in an attempt to get some wallpaper-worthy shots. I'm currently using photo #4 on my phone so I'd consider it a success! (Side note, don't cherry blossoms look absolutely delicious? I'm so tempted to just eat one...)",
		"photos":  5
	},
	{
		"title":   "Wood Textures",
		"date":    "2024-03-16",
		"camera":  "Sony Mavica FD91",
		"caption": "Nothing too wild, just some cool wood textures I came across while walking along a trail at a local metro park. ",
		"photos":  2
	},
	{
		"title":   "Kent State University, again",
		"date":    "2024-03-02",
		"camera":  "Sony Mavica FD91",
		"caption": "Some more abstract architectural shots I took while hanging out with a couple of friends at Kent State University.",
		"photos":  4
	},
	{
		"title":   "Kent State University",
		"date":    "2024-02-04",
		"camera":  "Sony Mavica FD91",
		"caption": "A friend and I took a walk through the Kent State University campus and surrounding downtown to capture some of the cool architecture in the area.",
		"photos":  7
	},
	{
		"title":   "FD91 First Attempt: Akron at Night",
		"date":    "2023-11-10",
		"camera":  "Sony Mavica FD91",
		"caption": "I recently came across my coolest thrift store find of all time - a Sony Mavica FD91! It's the coolest Mavica around with its insane 14x optical zoom lens, SteadyShot, manual focus and exposure controls, and overall wild industrial design. I took it on a walk around downtown Akron around sunset to see what its low-light performance is like, and it's not too bad! That zoom lens is absolutely insane though - check out those close-ups of the setting sun and the moon! This Mav has quickly became my favorite camera of all time.",
		"photos":  5
	}
]